Kamalbura/esp32-rc-race-car/transmitter_code/transmitter_code.ino
#include <Arduino.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <esp_idf_version.h>
#include <Wire.h>
#include <SPI.h>
#include <Adafruit_ADS1X15.h>
#include <Adafruit_GFX.h>
#include <Adafruit_ST7735.h>
#include <Adafruit_NeoPixel.h>
#include <Preferences.h>

/* ================= RADIO CONFIG ================= */
#define ESPNOW_CHANNEL 6
#define SEND_INTERVAL_MS 10
#define TELEMETRY_STALE_MS 500

uint8_t RECEIVER_MAC[6] = {0xB4, 0x3A, 0x45, 0x3F, 0xA4, 0xE8};

const uint8_t ESPNOW_PMK[16] = {
  0x52, 0x43, 0x52, 0x41, 0x43, 0x45, 0x50, 0x4D,
  0x4B, 0x32, 0x30, 0x32, 0x36, 0x30, 0x34, 0x15
};

const uint8_t ESPNOW_LMK[16] = {
  0x42, 0x54, 0x53, 0x45, 0x53, 0x50, 0x4E, 0x4F,
  0x57, 0x52, 0x41, 0x57, 0x41, 0x44, 0x43, 0x31
};

/* ================= TRANSMITTER PIN CONFIG ================= */
#define I2C_SDA_PIN 8
#define I2C_SCL_PIN 9
#define ADS1115_ADDR 0x48

#define SPI_SCK_PIN 12
#define SPI_MOSI_PIN 11
#define SPI_MISO_PIN 13
#define DISPLAY_CS_PIN 15
#define DISPLAY_DC_PIN 16
#define DISPLAY_RST_PIN 17

#define ENCODER_A_PIN 4
#define ENCODER_B_PIN 5
#define ENCODER_SW_PIN 6
#define BOOT_BUTTON_PIN 0

/* ================= DISPLAY CONFIG ================= */
#define DISPLAY_WIDTH 128
#define DISPLAY_HEIGHT 128
#define DISPLAY_ROTATION 0

/* ================= STATUS RGB LED ================= */
#define BUILTIN_RGB_PIN 48
#define BUILTIN_RGB_COUNT 1
#define BUILTIN_RGB_BRIGHTNESS 24

/* ================= PACKET FORMAT ================= */
#define RC_PACKET_VERSION 1
#define BTN_KILL 0x01
#define BTN_LIGHTS 0x02
#define BTN_AUX1 0x04
#define BTN_CALIBRATION BTN_AUX1

#define BUTTON_DEBOUNCE_MS 40
#define BUTTON_LONG_PRESS_MS 700
#define BUTTON_MULTI_CLICK_MS 700
#define CALIBRATION_ENTRY_CLICKS 4
#define FULL_SPEED_LIMIT 255
#define CAL_CAPTURE_SAMPLES 80
#define CAL_CAPTURE_DELAY_MS 2
#define CAL_STORE_NS "txcal"
#define CAL_STORE_KEY "axis_v1"
#define CAL_STORE_MAGIC 0x54584341UL  // "TXCA"
#define CAL_STORE_VERSION 1

#define STEERING_AXIS_CH 0
#define THROTTLE_AXIS_CH 1
#define AUX1_AXIS_CH 2
#define AUX2_AXIS_CH 3
#define SWAP_STEERING_LEFT_RIGHT 0

struct __attribute__((packed)) ControlPacket {
  uint8_t version;
  uint16_t sequence;
  int16_t throttle;     // -1000 reverse, 0 stop, +1000 forward
  int16_t steering;     // -1000 left, 0 center, +1000 right
  uint16_t speedLimit;  // 0..255
  int16_t aux1;         // raw mapped joystick axis
  int16_t aux2;         // raw mapped joystick axis
  uint8_t mode;         // 1..3
  uint8_t buttons;      // BTN_* mask
  uint16_t crc;
};

struct __attribute__((packed)) TelemetryPacket {
  uint8_t version;
  uint16_t sequenceAck;
  uint16_t batteryMv;
  int16_t leftMotor;
  int16_t rightMotor;
  uint8_t linkState;
  uint16_t packetAgeMs;
  uint16_t crc;
};

static_assert(sizeof(ControlPacket) <= 250, "ESP-NOW v1 packet must stay <= 250 bytes");

enum CalStep : uint8_t {
  CAL_CENTER = 0,
  CAL_BOTH_UP = 1,
  CAL_BOTH_DOWN = 2,
  CAL_BOTH_LEFT = 3,
  CAL_BOTH_RIGHT = 4,
  CAL_DONE = 5
};

struct StoredAxisCal {
  int16_t minRaw;
  int16_t centerRaw;
  int16_t maxRaw;
  int16_t deadbandRaw;
  uint8_t invert;
  uint8_t reserved[3];
};

struct StoredCalibration {
  uint32_t magic;
  uint16_t version;
  uint16_t crc;
  StoredAxisCal axis[4];
};

Adafruit_ADS1115 ads;
Adafruit_ST7735 tft(DISPLAY_CS_PIN, DISPLAY_DC_PIN, DISPLAY_RST_PIN);
Adafruit_NeoPixel statusPixel(BUILTIN_RGB_COUNT, BUILTIN_RGB_PIN, NEO_GRB + NEO_KHZ800);

struct AxisCal {
  int16_t minRaw;
  int16_t centerRaw;
  int16_t maxRaw;
  bool invert;
  int16_t deadbandRaw;
};

// Current bench mapping:
// A0 = joystick horizontal (steering), A1 = joystick vertical (throttle).
// The previous build had these swapped, which caused:
// forward->left, right->reverse, left->forward, back->right.
// These provisional min/max values should still be replaced by a clean full capture.
// Calibrated from guided_calibration_test @ 2026-04-16.
// Center values measured at rest:  A0≈21220  A1≈20560  A2≈21090  A3≈20440.
// Deadband raised to 500 (~3.6%) to eliminate center creep from ADC noise.
AxisCal axisCal[4] = {
  {4000, 21220, 32000, false, 500},  // A0 steering
  {4000, 20560, 32000, true,  500},  // A1 throttle  (inverted to match physical direction)
  {4000, 21090, 32000, false, 500},  // A2 aux / speed trim if needed
  {4000, 20440, 32000, false, 500}   // A3 mode select
};

class AxisFilter {
public:
  int16_t push(int16_t value) {
    total -= samples[index];
    samples[index] = value;
    total += value;
    index = (index + 1) % FILTER_SIZE;
    if (count < FILTER_SIZE) count++;
    return total / count;
  }

private:
  static const uint8_t FILTER_SIZE = 3;
  int16_t samples[FILTER_SIZE] = {0, 0, 0};
  int32_t total = 0;
  uint8_t index = 0;
  uint8_t count = 0;
};

AxisFilter filters[4];

volatile bool sendReady = true;
volatile bool lastSendOk = false;

portMUX_TYPE telemetryMux = portMUX_INITIALIZER_UNLOCKED;
TelemetryPacket latestTelemetry = {};
bool telemetryReady = false;
uint32_t lastTelemetryRxMs = 0;

uint16_t sequenceNumber = 0;
bool killLatched = true;
bool lightsEnabled = true;
bool encoderSwitchDown = false;
bool bootButtonDown = false;
uint32_t encoderButtonPressCount = 0;
bool actionButtonDown = false;
bool longPressHandled = false;
uint32_t buttonPressStartMs = 0;
uint8_t shortPressCount = 0;
uint32_t shortPressDeadlineMs = 0;
uint32_t lastSendMs = 0;
uint32_t lastScreenMs = 0;
uint32_t lastSerialMs = 0;

bool runtimeCalActive = false;
uint8_t runtimeCalStep = CAL_CENTER;
int16_t calSamples[CAL_DONE][4] = {};

/* ================= DUAL-CORE DISPLAY OFFLOAD ================= */
// Display + serial print run on Core 0 so the control loop on Core 1
// is never blocked by slow SPI writes (~15ms per frame).
ControlPacket lastBuiltPacket = {};
portMUX_TYPE displayMux = portMUX_INITIALIZER_UNLOCKED;

/* ================= ADC READ OPTIMIZATION ================= */
// Throttle + steering are read every cycle (~2.3ms for 2 channels).
// Aux channels are read every 5th cycle to save ~2.3ms on 80% of iterations.
int16_t cachedAux1 = 0;
int16_t cachedAux2 = 0;
uint8_t auxReadCounter = 0;

uint16_t crc16Ccitt(const uint8_t *data, size_t len) {
  uint16_t crc = 0xFFFF;
  while (len--) {
    crc ^= (uint16_t)(*data++) << 8;
    for (uint8_t i = 0; i < 8; i++) {
      crc = (crc & 0x8000) ? (crc << 1) ^ 0x1021 : (crc << 1);
    }
  }
  return crc;
}

uint16_t calibrationStorageCrc(const StoredCalibration &stored) {
  StoredCalibration copy = stored;
  copy.crc = 0;
  return crc16Ccitt((const uint8_t *)&copy, sizeof(copy));
}

StoredCalibration buildStoredCalibration() {
  StoredCalibration stored = {};
  stored.magic = CAL_STORE_MAGIC;
  stored.version = CAL_STORE_VERSION;
  for (uint8_t i = 0; i < 4; i++) {
    stored.axis[i].minRaw = axisCal[i].minRaw;
    stored.axis[i].centerRaw = axisCal[i].centerRaw;
    stored.axis[i].maxRaw = axisCal[i].maxRaw;
    stored.axis[i].deadbandRaw = axisCal[i].deadbandRaw;
    stored.axis[i].invert = axisCal[i].invert ? 1 : 0;
  }
  stored.crc = calibrationStorageCrc(stored);
  return stored;
}

void applyStoredCalibration(const StoredCalibration &stored) {
  for (uint8_t i = 0; i < 4; i++) {
    axisCal[i].minRaw = stored.axis[i].minRaw;
    axisCal[i].centerRaw = stored.axis[i].centerRaw;
    axisCal[i].maxRaw = stored.axis[i].maxRaw;
    axisCal[i].deadbandRaw = stored.axis[i].deadbandRaw;
    axisCal[i].invert = stored.axis[i].invert != 0;
  }
}

bool saveCalibrationToNvs() {
  StoredCalibration stored = buildStoredCalibration();
  Preferences prefs;
  if (!prefs.begin(CAL_STORE_NS, false)) {
    Serial.println("cal save failed: nvs open");
    return false;
  }
  size_t written = prefs.putBytes(CAL_STORE_KEY, &stored, sizeof(stored));
  prefs.end();
  bool ok = written == sizeof(stored);
  Serial.println(ok ? "cal saved to nvs" : "cal save failed: short write");
  return ok;
}

bool loadCalibrationFromNvs() {
  Preferences prefs;
  if (!prefs.begin(CAL_STORE_NS, true)) {
    Serial.println("cal load skipped: nvs open");
    return false;
  }

  StoredCalibration stored = {};
  size_t read = prefs.getBytes(CAL_STORE_KEY, &stored, sizeof(stored));
  prefs.end();
  if (read != sizeof(stored)) {
    Serial.println("cal load: no stored calibration");
    return false;
  }
  if (stored.magic != CAL_STORE_MAGIC || stored.version != CAL_STORE_VERSION) {
    Serial.println("cal load: header mismatch");
    return false;
  }
  if (calibrationStorageCrc(stored) != stored.crc) {
    Serial.println("cal load: crc mismatch");
    return false;
  }

