Kamalbura/esp32-rc-race-car/transmitter_code/transmitter_code.ino
  applyStoredCalibration(stored);
  Serial.println("cal loaded from nvs");
  return true;
}

uint16_t controlCrc(const ControlPacket &packet) {
  ControlPacket copy = packet;
  copy.crc = 0;
  return crc16Ccitt((const uint8_t *)&copy, sizeof(copy));
}

uint16_t telemetryCrc(const TelemetryPacket &packet) {
  TelemetryPacket copy = packet;
  copy.crc = 0;
  return crc16Ccitt((const uint8_t *)&copy, sizeof(copy));
}

bool isBroadcastMac(const uint8_t *mac) {
  for (uint8_t i = 0; i < 6; i++) {
    if (mac[i] != 0xFF) return false;
  }
  return true;
}

void printMac(const uint8_t *mac) {
  Serial.printf("%02X:%02X:%02X:%02X:%02X:%02X",
                mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
}

bool addPeer(const uint8_t *mac) {
  if (esp_now_is_peer_exist(mac)) return true;

  esp_now_peer_info_t peer = {};
  memcpy(peer.peer_addr, mac, 6);
  peer.channel = ESPNOW_CHANNEL;
  peer.encrypt = true;
  peer.ifidx = WIFI_IF_STA;
  memcpy(peer.lmk, ESPNOW_LMK, sizeof(ESPNOW_LMK));

  esp_err_t result = esp_now_add_peer(&peer);
  return result == ESP_OK || result == ESP_ERR_ESPNOW_EXIST;
}

#if ESP_IDF_VERSION_MAJOR > 5 || (ESP_IDF_VERSION_MAJOR == 5 && ESP_IDF_VERSION_MINOR >= 5)
void onDataSent(const esp_now_send_info_t *txInfo, esp_now_send_status_t status) {
  (void)txInfo;
#else
void onDataSent(const uint8_t *mac, esp_now_send_status_t status) {
  (void)mac;
#endif
  lastSendOk = (status == ESP_NOW_SEND_SUCCESS);
  sendReady = true;
}

#if ESP_IDF_VERSION_MAJOR >= 5
void onTelemetryRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
  (void)info;
#else
void onTelemetryRecv(const uint8_t *mac, const uint8_t *data, int len) {
  (void)mac;
#endif
  if (len != sizeof(TelemetryPacket)) return;

  TelemetryPacket packet;
  memcpy(&packet, data, sizeof(packet));
  if (packet.version != RC_PACKET_VERSION) return;
  if (telemetryCrc(packet) != packet.crc) return;

  portENTER_CRITICAL(&telemetryMux);
  latestTelemetry = packet;
  telemetryReady = true;
  lastTelemetryRxMs = millis();
  portEXIT_CRITICAL(&telemetryMux);
}

int16_t splitMapAxis(int16_t raw, const AxisCal &cal) {
  int32_t value;

  if (abs(raw - cal.centerRaw) <= cal.deadbandRaw) {
    value = 0;
  } else if (raw > cal.centerRaw) {
    int32_t span = max<int32_t>(1, cal.maxRaw - cal.centerRaw - cal.deadbandRaw);
    value = (int32_t)(raw - cal.centerRaw - cal.deadbandRaw) * 1000L / span;
  } else {
    int32_t span = max<int32_t>(1, cal.centerRaw - cal.minRaw - cal.deadbandRaw);
    value = -(int32_t)(cal.centerRaw - raw - cal.deadbandRaw) * 1000L / span;
  }

  value = constrain(value, -1000, 1000);
  if (cal.invert) value = -value;
  return (int16_t)value;
}

int16_t readAxis(uint8_t channel) {
  int16_t raw = ads.readADC_SingleEnded(channel);
  int16_t filtered = filters[channel].push(raw);
  return splitMapAxis(filtered, axisCal[channel]);
}

const char *calStepText(uint8_t step) {
  switch (step) {
    case CAL_CENTER: return "Center all sticks";
    case CAL_BOTH_UP: return "Both sticks UP";
    case CAL_BOTH_DOWN: return "Both sticks DOWN";
    case CAL_BOTH_LEFT: return "Both sticks LEFT";
    case CAL_BOTH_RIGHT: return "Both sticks RIGHT";
    default: return "Done";
  }
}

void captureCalibrationStep(uint8_t step) {
  int32_t sum[4] = {0, 0, 0, 0};
  for (uint8_t n = 0; n < CAL_CAPTURE_SAMPLES; n++) {
    for (uint8_t ch = 0; ch < 4; ch++) {
      sum[ch] += ads.readADC_SingleEnded(ch);
    }
    delay(CAL_CAPTURE_DELAY_MS);
  }
  for (uint8_t ch = 0; ch < 4; ch++) {
    calSamples[step][ch] = (int16_t)(sum[ch] / CAL_CAPTURE_SAMPLES);
  }
}

void normalizeAxisBounds(AxisCal &cal) {
  if (cal.minRaw > cal.centerRaw - 200) cal.minRaw = cal.centerRaw - 200;
  if (cal.maxRaw < cal.centerRaw + 200) cal.maxRaw = cal.centerRaw + 200;
}

void applyRuntimeCalibration() {
  axisCal[STEERING_AXIS_CH].centerRaw = calSamples[CAL_CENTER][STEERING_AXIS_CH];
  axisCal[THROTTLE_AXIS_CH].centerRaw = calSamples[CAL_CENTER][THROTTLE_AXIS_CH];
  axisCal[AUX1_AXIS_CH].centerRaw = calSamples[CAL_CENTER][AUX1_AXIS_CH];
  axisCal[AUX2_AXIS_CH].centerRaw = calSamples[CAL_CENTER][AUX2_AXIS_CH];

  int16_t steerLeft = calSamples[CAL_BOTH_LEFT][STEERING_AXIS_CH];
  int16_t steerRight = calSamples[CAL_BOTH_RIGHT][STEERING_AXIS_CH];
  axisCal[STEERING_AXIS_CH].minRaw = min(steerLeft, steerRight);
  axisCal[STEERING_AXIS_CH].maxRaw = max(steerLeft, steerRight);
  axisCal[STEERING_AXIS_CH].invert = (steerRight < axisCal[STEERING_AXIS_CH].centerRaw);

  int16_t thrUp = calSamples[CAL_BOTH_UP][THROTTLE_AXIS_CH];
  int16_t thrDown = calSamples[CAL_BOTH_DOWN][THROTTLE_AXIS_CH];
  axisCal[THROTTLE_AXIS_CH].minRaw = min(thrUp, thrDown);
  axisCal[THROTTLE_AXIS_CH].maxRaw = max(thrUp, thrDown);
  axisCal[THROTTLE_AXIS_CH].invert = (thrUp < axisCal[THROTTLE_AXIS_CH].centerRaw);

  axisCal[AUX1_AXIS_CH].minRaw = min(calSamples[CAL_BOTH_LEFT][AUX1_AXIS_CH], calSamples[CAL_BOTH_RIGHT][AUX1_AXIS_CH]);
  axisCal[AUX1_AXIS_CH].maxRaw = max(calSamples[CAL_BOTH_LEFT][AUX1_AXIS_CH], calSamples[CAL_BOTH_RIGHT][AUX1_AXIS_CH]);
  axisCal[AUX2_AXIS_CH].minRaw = min(calSamples[CAL_BOTH_UP][AUX2_AXIS_CH], calSamples[CAL_BOTH_DOWN][AUX2_AXIS_CH]);
  axisCal[AUX2_AXIS_CH].maxRaw = max(calSamples[CAL_BOTH_UP][AUX2_AXIS_CH], calSamples[CAL_BOTH_DOWN][AUX2_AXIS_CH]);

  normalizeAxisBounds(axisCal[STEERING_AXIS_CH]);
  normalizeAxisBounds(axisCal[THROTTLE_AXIS_CH]);
  normalizeAxisBounds(axisCal[AUX1_AXIS_CH]);
  normalizeAxisBounds(axisCal[AUX2_AXIS_CH]);

  for (uint8_t i = 0; i < 4; i++) {
    filters[i] = AxisFilter();
  }

  saveCalibrationToNvs();

  Serial.printf("cal applied: steer ctr=%d min=%d max=%d inv=%u, thr ctr=%d min=%d max=%d inv=%u\n",
                axisCal[STEERING_AXIS_CH].centerRaw,
                axisCal[STEERING_AXIS_CH].minRaw,
                axisCal[STEERING_AXIS_CH].maxRaw,
                axisCal[STEERING_AXIS_CH].invert ? 1 : 0,
                axisCal[THROTTLE_AXIS_CH].centerRaw,
                axisCal[THROTTLE_AXIS_CH].minRaw,
                axisCal[THROTTLE_AXIS_CH].maxRaw,
                axisCal[THROTTLE_AXIS_CH].invert ? 1 : 0);
}

void startRuntimeCalibration() {
  runtimeCalActive = true;
  runtimeCalStep = CAL_CENTER;
  killLatched = true;
  shortPressCount = 0;
  shortPressDeadlineMs = 0;
  Serial.println("calibration start: press BOOT/encoder to capture each step");
}

void captureNextCalibrationStep() {
  if (!runtimeCalActive) return;
  if (runtimeCalStep >= CAL_DONE) return;

  captureCalibrationStep(runtimeCalStep);
  Serial.printf("cal step %u captured: %s\n", runtimeCalStep + 1, calStepText(runtimeCalStep));
  runtimeCalStep++;

  if (runtimeCalStep >= CAL_DONE) {
    applyRuntimeCalibration();
    runtimeCalActive = false;
    Serial.println("calibration complete");
  }
}

void updateEncoder() {
  static bool rawButtonState = false;
  static bool lastStableButton = false;
  static uint32_t lastBounceMs = 0;

  bool encoderButton = digitalRead(ENCODER_SW_PIN);
  bool bootButton = digitalRead(BOOT_BUTTON_PIN);
  encoderSwitchDown = (encoderButton == LOW);
  bootButtonDown = (bootButton == LOW);
  bool button = encoderSwitchDown || bootButtonDown;

