Kamalbura/esp32-rc-race-car/transmitter_code/transmitter_code.ino
  if (button != rawButtonState) {
    rawButtonState = button;
    lastBounceMs = millis();
  }

  if (millis() - lastBounceMs >= BUTTON_DEBOUNCE_MS && button != lastStableButton) {
    lastStableButton = button;

    if (button) {
      actionButtonDown = true;
      longPressHandled = false;
      buttonPressStartMs = millis();
    } else {
      actionButtonDown = false;
      if (!longPressHandled) {
        encoderButtonPressCount++;
        if (runtimeCalActive) {
          captureNextCalibrationStep();
        } else {
          shortPressCount++;
          shortPressDeadlineMs = millis() + BUTTON_MULTI_CLICK_MS;
          Serial.printf("short press count=%lu shortGroup=%u encSw=%u boot=%u\n",
                        encoderButtonPressCount,
                        shortPressCount,
                        encoderSwitchDown ? 1 : 0,
                        bootButtonDown ? 1 : 0);
        }
      }
    }
  }

  if (actionButtonDown && !longPressHandled && millis() - buttonPressStartMs >= BUTTON_LONG_PRESS_MS) {
    killLatched = !killLatched;
    longPressHandled = true;
    shortPressCount = 0;
    shortPressDeadlineMs = 0;
    Serial.printf("long press kill=%u encSw=%u boot=%u\n",
                  killLatched,
                  encoderSwitchDown ? 1 : 0,
                  bootButtonDown ? 1 : 0);
  }

  if (!actionButtonDown && shortPressCount > 0 && millis() >= shortPressDeadlineMs) {
    if (shortPressCount == 1) {
      lightsEnabled = !lightsEnabled;
      Serial.printf("lights=%u via single press\n", lightsEnabled ? 1 : 0);
    } else if (shortPressCount >= CALIBRATION_ENTRY_CLICKS) {
      startRuntimeCalibration();
    }
    shortPressCount = 0;
    shortPressDeadlineMs = 0;
  }
}

uint8_t modeFromAxis(int16_t axis) {
  if (axis < -333) return 1;
  if (axis > 333) return 3;
  return 2;
}

ControlPacket buildPacket() {
  ControlPacket packet = {};
  packet.version = RC_PACKET_VERSION;
  packet.sequence = ++sequenceNumber;

  // Always read throttle + steering at full rate (2 ADC reads ~2.3ms).
  packet.throttle = readAxis(THROTTLE_AXIS_CH);
  int16_t steering = readAxis(STEERING_AXIS_CH);
#if SWAP_STEERING_LEFT_RIGHT
  steering = -steering;
#endif
  packet.steering = steering;

  // Read aux channels at 1/5 rate (~20 Hz still, saves ~2.3ms on 80% of loops).
  if (++auxReadCounter >= 5) {
    auxReadCounter = 0;
    cachedAux1 = readAxis(AUX1_AXIS_CH);
    cachedAux2 = readAxis(AUX2_AXIS_CH);
  }
  packet.aux1 = cachedAux1;
  packet.aux2 = cachedAux2;

  packet.speedLimit = FULL_SPEED_LIMIT;
  packet.mode = modeFromAxis(packet.aux2);
  packet.buttons = 0;
  if (killLatched) packet.buttons |= BTN_KILL;
  if (lightsEnabled) packet.buttons |= BTN_LIGHTS;
  packet.crc = controlCrc(packet);
  return packet;
}

void drawScreen(const ControlPacket &packet) {
  if (millis() - lastScreenMs < 100) return;
  lastScreenMs = millis();

  // Read telemetry under mutex to avoid torn reads
  TelemetryPacket telCopy;
  bool telFresh;
  portENTER_CRITICAL(&telemetryMux);
  telCopy = latestTelemetry;
  telFresh = telemetryReady && (millis() - lastTelemetryRxMs < TELEMETRY_STALE_MS);
  portEXIT_CRITICAL(&telemetryMux);

  if (runtimeCalActive) {
    tft.fillScreen(ST77XX_BLACK);
    tft.setTextSize(1);
    tft.setTextColor(ST77XX_CYAN);
    tft.setCursor(0, 0);
    tft.print("CALIBRATION");
    tft.setTextColor(ST77XX_WHITE);
    tft.setCursor(0, 16);
    tft.print("Step ");
    tft.print(runtimeCalStep + 1);
    tft.print("/");
    tft.print((uint8_t)CAL_DONE);
    tft.setCursor(0, 30);
    tft.print(calStepText(runtimeCalStep));
    tft.setCursor(0, 48);
    tft.print("Press BOOT/SW");
    tft.setCursor(0, 60);
    tft.print("to capture");
    tft.setCursor(0, 84);
    tft.print("THR ");
    tft.print(packet.throttle);
    tft.setCursor(64, 84);
    tft.print("STR ");
    tft.print(packet.steering);
    tft.setCursor(0, 96);
    tft.print("AUX1 ");
    tft.print(packet.aux1);
    tft.setCursor(64, 96);
    tft.print("AUX2 ");
    tft.print(packet.aux2);
    tft.setCursor(0, 114);
    tft.setTextColor(ST77XX_YELLOW);
    tft.print("Hold position steady");
    return;
  }

  // Clear only the value regions instead of full screen to eliminate flicker.
  // Row layout: 0, 18, 32, 46, 66, 80, 94, 108 — each row is ~12px tall.
  tft.fillRect(0, 0, 128, 14, ST77XX_BLACK);     // header row
  tft.fillRect(0, 18, 128, 12, ST77XX_BLACK);    // THR
  tft.fillRect(0, 32, 128, 12, ST77XX_BLACK);    // STR
  tft.fillRect(0, 46, 128, 12, ST77XX_BLACK);    // SPD + mode
  tft.fillRect(0, 66, 128, 12, ST77XX_BLACK);    // drive/cal + TX status
  tft.fillRect(0, 80, 128, 12, ST77XX_BLACK);    // RX telemetry row 1
  tft.fillRect(0, 94, 128, 12, ST77XX_BLACK);    // RX telemetry row 2
  tft.fillRect(0, 108, 128, 20, ST77XX_BLACK);   // SW + lights row

  tft.setTextSize(1);
  tft.setTextColor(ST77XX_WHITE);
  tft.setCursor(0, 0);
  tft.print("RC TX");

  tft.setCursor(48, 0);
  tft.setTextColor(killLatched ? ST77XX_RED : ST77XX_GREEN);
  tft.print(killLatched ? "KILL" : "ARMED");

  tft.setTextColor(ST77XX_WHITE);
  tft.setCursor(0, 18);
  tft.print("THR ");
  tft.print(packet.throttle);
  tft.setCursor(0, 32);
  tft.print("STR ");
  tft.print(packet.steering);
  tft.setCursor(0, 46);
  tft.print("SPD FULL");
  tft.setCursor(92, 46);
  tft.print("M");
  tft.print(packet.mode);

  tft.setCursor(0, 66);
  tft.setTextColor(ST77XX_WHITE);
  tft.print("RACE");

  tft.setCursor(72, 66);
  tft.setTextColor(lastSendOk ? ST77XX_GREEN : ST77XX_YELLOW);
  tft.print(lastSendOk ? "TX OK" : "WAIT");

  if (telFresh) {
    tft.setCursor(0, 80);
    tft.setTextColor(ST77XX_CYAN);
    tft.print("RX ");
    tft.print(telCopy.packetAgeMs);
    tft.print("ms");

    tft.setCursor(0, 94);
    tft.print("L ");
    tft.print(telCopy.leftMotor);
    tft.setCursor(64, 94);
    tft.print("R ");
    tft.print(telCopy.rightMotor);
  } else {
    tft.setCursor(0, 80);
    tft.setTextColor(ST77XX_RED);
    tft.print("NO RX TEL");
  }

  tft.setTextColor(encoderSwitchDown ? ST77XX_GREEN : ST77XX_WHITE);
  tft.setCursor(0, 108);
  tft.print("SW ");
  tft.print(encoderSwitchDown ? "DOWN " : "UP   ");
  tft.print(bootButtonDown ? " B" : " -");
  tft.print(encoderButtonPressCount);
  tft.setCursor(84, 108);
  tft.setTextColor(lightsEnabled ? ST77XX_YELLOW : ST77XX_WHITE);
  tft.print(lightsEnabled ? "LT" : "lt");
}

