Kamalbura/esp32-rc-race-car/transmitter_code/transmitter_code.ino
void setStatusPixel(uint8_t r, uint8_t g, uint8_t b) {
  statusPixel.setPixelColor(0, statusPixel.Color(r, g, b));
  statusPixel.show();
}

void updateStatusLed(const ControlPacket &packet) {
  static uint32_t lastUpdate = 0;
  if (millis() - lastUpdate < 80) return;
  lastUpdate = millis();

  bool telFresh;
  portENTER_CRITICAL(&telemetryMux);
  telFresh = telemetryReady && (millis() - lastTelemetryRxMs < TELEMETRY_STALE_MS);
  portEXIT_CRITICAL(&telemetryMux);

  if (packet.buttons & BTN_KILL) {
    uint8_t pulse = (millis() / 200) % 2 ? 80 : 8;
    setStatusPixel(pulse, 0, 0);
  } else if (!lastSendOk) {
    setStatusPixel(80, 45, 0);
  } else if (telFresh) {
    setStatusPixel(0, 70, 0);
  } else {
    setStatusPixel(0, 0, 60);
  }
}

void printStatus(const ControlPacket &packet) {
  if (millis() - lastSerialMs < 1000) return;
  lastSerialMs = millis();

  TelemetryPacket telCopy;
  bool telFresh;
  uint32_t telAgeMs;
  portENTER_CRITICAL(&telemetryMux);
  telCopy = latestTelemetry;
  telFresh = telemetryReady && (millis() - lastTelemetryRxMs < TELEMETRY_STALE_MS);
  telAgeMs = millis() - lastTelemetryRxMs;
  portEXIT_CRITICAL(&telemetryMux);

  Serial.printf("seq=%u thr=%d steer=%d limit=%u mode=%u kill=%u lights=%u tx=%s",
                packet.sequence, packet.throttle, packet.steering,
                packet.speedLimit, packet.mode, killLatched, lightsEnabled,
                lastSendOk ? "ok" : "pending/fail");
  Serial.printf(" calRun=%u step=%u encSw=%u boot=%u swCount=%lu",
                runtimeCalActive ? 1 : 0,
                runtimeCalActive ? runtimeCalStep + 1 : 0,
                encoderSwitchDown ? 1 : 0,
                bootButtonDown ? 1 : 0,
                encoderButtonPressCount);
  if (telFresh) {
    Serial.printf(" rxAge=%ums left=%d right=%d batt=%umV",
                  telCopy.packetAgeMs,
                  telCopy.leftMotor,
                  telCopy.rightMotor,
                  telCopy.batteryMv);
  } else {
    Serial.printf(" telStale=%lums", telAgeMs);
  }
  Serial.println();
}

void setupEspNow() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  WiFi.setSleep(false);
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);

  if (esp_now_init() != ESP_OK) {
    Serial.println("ESP-NOW init failed");
    while (true) delay(1000);
  }

  esp_now_set_pmk(ESPNOW_PMK);
  esp_now_register_send_cb(onDataSent);
  esp_now_register_recv_cb(onTelemetryRecv);

  if (!addPeer(RECEIVER_MAC)) {
    Serial.println("Receiver peer add failed");
    while (true) delay(1000);
  }
}

void setup() {
  Serial.begin(115200);
  delay(400);

  pinMode(ENCODER_A_PIN, INPUT_PULLUP);
  pinMode(ENCODER_B_PIN, INPUT_PULLUP);
  pinMode(ENCODER_SW_PIN, INPUT_PULLUP);
  pinMode(BOOT_BUTTON_PIN, INPUT_PULLUP);

  statusPixel.begin();
  statusPixel.setBrightness(BUILTIN_RGB_BRIGHTNESS);
  setStatusPixel(0, 0, 20);

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(400000);
  if (!ads.begin(ADS1115_ADDR, &Wire)) {
    Serial.println("ADS1115 not found. Check SDA/SCL, power, and ADDR to GND.");
    while (true) delay(1000);
  }
  ads.setGain(GAIN_ONE);
  ads.setDataRate(RATE_ADS1115_860SPS);
  loadCalibrationFromNvs();

  SPI.begin(SPI_SCK_PIN, SPI_MISO_PIN, SPI_MOSI_PIN);
  tft.initR(INITR_144GREENTAB);
  tft.setRotation(DISPLAY_ROTATION);
  tft.fillScreen(ST77XX_BLACK);

  setupEspNow();

  Serial.print("Transmitter MAC: ");
  Serial.println(WiFi.macAddress());
  Serial.print("Receiver peer: ");
  printMac(RECEIVER_MAC);
  Serial.println(" (secure direct)");
  Serial.println("Long press encoder/BOOT toggles kill. Single press toggles lights.");
  Serial.println("Four short presses starts calibration wizard (center/up/down/left/right).");
  Serial.println("Race mode sends full speed limit; joystick tilt controls speed.");

  // Launch display task on Core 0 so SPI writes never block the control loop.
  xTaskCreatePinnedToCore(displayTask, "disp", 4096, NULL, 1, NULL, 0);
}

// Display + serial task on Core 0. Runs independently from control loop.
void displayTask(void *param) {
  (void)param;
  for (;;) {
    ControlPacket pkt;
    portENTER_CRITICAL(&displayMux);
    pkt = lastBuiltPacket;
    portEXIT_CRITICAL(&displayMux);

    drawScreen(pkt);
    printStatus(pkt);

    vTaskDelay(pdMS_TO_TICKS(50));  // ~20 fps check rate, drawScreen rate-limits to 10 fps
  }
}

void loop() {
  updateEncoder();
  ControlPacket packet = buildPacket();

  if (sendReady && millis() - lastSendMs >= SEND_INTERVAL_MS) {
    sendReady = false;
    lastSendMs = millis();
    esp_err_t result = esp_now_send(RECEIVER_MAC, (const uint8_t *)&packet, sizeof(packet));
    if (result != ESP_OK) {
      sendReady = true;
      lastSendOk = false;
    }
  }

  // Share latest packet with Core 0 display task (fast ~20 byte copy)
  portENTER_CRITICAL(&displayMux);
  lastBuiltPacket = packet;
  portEXIT_CRITICAL(&displayMux);

  // Status LED stays on Core 1 for immediate visual feedback
  updateStatusLed(packet);
}
